//
// Created by Enisel Kunch on 14.10.24.
//
//Напишете програма, която приема цели числа и приключва работа, когато се въведат 5 положителни числа. Накрая да се изведе сумата от положителните числа.
//
//Пример:
//
//Вход:
//
//12
//10
//-9
//11
//-1
//-2
//1
//5
//Изход:
//
//39

#include <iostream>

int main()
{
    int n;
    int sum = 0;
    int count = 0;
    while(count < 5)
    {
        std::cin >> n;

        if(n > 0)
        {
            count++;
            sum +=n;
        }
    }
    std::cout << sum;
}